waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_i2c_smbus.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_i2c_smbus.h
  * @author  FMSH Application Team
  * @brief   Head file of I2C_SMBUS FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_I2C_SMBUS_H
#define __FM33FK5XX_FL_I2C_SMBUS_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup I2C_SMBUS_FL_ES_INIT I2C_SMBUS Exported Init structures
  * @{
  */

typedef struct
{
    /** 主机时使用的时钟源*/
    uint32_t clockSource;

    /** I2C通讯速率*/
    uint32_t baudRate;

} FL_I2C_SMBUS_MasterMode_InitTypeDef;

/**
  * @brief I2C Slavemode Init Sturcture Definition
  */
typedef struct
{
    /** 从机模式从机地址 */
    uint32_t ownAddr;

    /** 从机模式地址位宽 */
    uint32_t ownAddrSize10bit;

    /** 从机时钟延展*/
    uint32_t SCLSEN;

} FL_I2C_SMBUS_SlaveMode_InitTypeDef;

/**
  * @brief FL I2C_SMBUS Init Sturcture definition
  */
//#warning "PLEASE INPUT THE INIT OR OTHER STRUCTURES DEFINITION HERE!!!"
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup I2C_SMBUS_FL_Exported_Constants I2C_SMBUS Exported Constants
  * @{
  */

#define    I2CSMB_CR1_EN_Pos                                      (0U)
#define    I2CSMB_CR1_EN_Msk                                      (0x1U << I2CSMB_CR1_EN_Pos)
#define    I2CSMB_CR1_EN                                          I2CSMB_CR1_EN_Msk

#define    I2CSMB_CR1_A10EN_Pos                                   (2U)
#define    I2CSMB_CR1_A10EN_Msk                                   (0x1U << I2CSMB_CR1_A10EN_Pos)
#define    I2CSMB_CR1_A10EN                                       I2CSMB_CR1_A10EN_Msk

#define    I2CSMB_CR1_CRCEN_Pos                                   (3U)
#define    I2CSMB_CR1_CRCEN_Msk                                   (0x1U << I2CSMB_CR1_CRCEN_Pos)
#define    I2CSMB_CR1_CRCEN                                       I2CSMB_CR1_CRCEN_Msk

#define    I2CSMB_CR1_DNF_Pos                                     (8U)
#define    I2CSMB_CR1_DNF_Msk                                     (0xfU << I2CSMB_CR1_DNF_Pos)
#define    I2CSMB_CR1_DNF                                         I2CSMB_CR1_DNF_Msk

#define    I2CSMB_CR1_ANFEN_Pos                                   (12U)
#define    I2CSMB_CR1_ANFEN_Msk                                   (0x1U << I2CSMB_CR1_ANFEN_Pos)
#define    I2CSMB_CR1_ANFEN                                       I2CSMB_CR1_ANFEN_Msk

#define    I2CSMB_CR1_TXDMAEN_Pos                                 (14U)
#define    I2CSMB_CR1_TXDMAEN_Msk                                 (0x1U << I2CSMB_CR1_TXDMAEN_Pos)
#define    I2CSMB_CR1_TXDMAEN                                     I2CSMB_CR1_TXDMAEN_Msk

#define    I2CSMB_CR1_RXDMAEN_Pos                                 (15U)
#define    I2CSMB_CR1_RXDMAEN_Msk                                 (0x1U << I2CSMB_CR1_RXDMAEN_Pos)
#define    I2CSMB_CR1_RXDMAEN                                     I2CSMB_CR1_RXDMAEN_Msk

#define    I2CSMB_CR1_SCLSEN_Pos                                  (16U)
#define    I2CSMB_CR1_SCLSEN_Msk                                  (0x1U << I2CSMB_CR1_SCLSEN_Pos)
#define    I2CSMB_CR1_SCLSEN                                      I2CSMB_CR1_SCLSEN_Msk

#define    I2CSMB_CR1_WKUPEN_Pos                                  (17U)
#define    I2CSMB_CR1_WKUPEN_Msk                                  (0x3U << I2CSMB_CR1_WKUPEN_Pos)
#define    I2CSMB_CR1_WKUPEN                                      I2CSMB_CR1_WKUPEN_Msk

#define    I2CSMB_CR1_GCEN_Pos                                    (19U)
#define    I2CSMB_CR1_GCEN_Msk                                    (0x1U << I2CSMB_CR1_GCEN_Pos)
#define    I2CSMB_CR1_GCEN                                        I2CSMB_CR1_GCEN_Msk

#define    I2CSMB_CR1_SMBHEN_Pos                                  (20U)
#define    I2CSMB_CR1_SMBHEN_Msk                                  (0x1U << I2CSMB_CR1_SMBHEN_Pos)
#define    I2CSMB_CR1_SMBHEN                                      I2CSMB_CR1_SMBHEN_Msk

#define    I2CSMB_CR1_SMBDEN_Pos                                  (21U)
#define    I2CSMB_CR1_SMBDEN_Msk                                  (0x1U << I2CSMB_CR1_SMBDEN_Pos)
#define    I2CSMB_CR1_SMBDEN                                      I2CSMB_CR1_SMBDEN_Msk

#define    I2CSMB_CR1_ALERTEN_Pos                                 (22U)
#define    I2CSMB_CR1_ALERTEN_Msk                                 (0x1U << I2CSMB_CR1_ALERTEN_Pos)
#define    I2CSMB_CR1_ALERTEN                                     I2CSMB_CR1_ALERTEN_Msk

#define    I2CSMB_CR1_AUTOEND_Pos                                 (23U)
#define    I2CSMB_CR1_AUTOEND_Msk                                 (0x1U << I2CSMB_CR1_AUTOEND_Pos)
#define    I2CSMB_CR1_AUTOEND                                     I2CSMB_CR1_AUTOEND_Msk

#define    I2CSMB_CR2_ALERT_Pos                                   (5U)
#define    I2CSMB_CR2_ALERT_Msk                                   (0x1U << I2CSMB_CR2_ALERT_Pos)
#define    I2CSMB_CR2_ALERT                                       I2CSMB_CR2_ALERT_Msk

#define    I2CSMB_CR2_ACKEN_Pos                                   (4U)
#define    I2CSMB_CR2_ACKEN_Msk                                   (0x1U << I2CSMB_CR2_ACKEN_Pos)
#define    I2CSMB_CR2_ACKEN                                       I2CSMB_CR2_ACKEN_Msk

