waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_i2c_smbus.h
#define    FL_I2CSMB_ALERT_STATUS_HIGH                            (0x0U << I2CSMB_CR2_ALERT_Pos)
#define    FL_I2CSMB_ALERT_STATUS_LOW                             (0x1U << I2CSMB_CR2_ALERT_Pos)

#define    FL_I2CSMB_RESPOND_ACK                                  (0x0U << I2CSMB_CR2_ACKEN_Pos)
#define    FL_I2CSMB_RESPOND_NACK                                 (0x1U << I2CSMB_CR2_ACKEN_Pos)

#define    FL_I2CSMB_MASTER_WRITE                                 (0x0U << I2CSMB_CR2_RWN_Pos)
#define    FL_I2CSMB_MASTER_READ                                  (0x1U << I2CSMB_CR2_RWN_Pos)

#define    FL_I2CSMB_TIMEOUTA_MODE_SCL                            (0x0U << I2CSMB_TOR_TIDLE_Pos)
#define    FL_I2CSMB_TIMEOUTA_MODE_IDLE                           (0x1U << I2CSMB_TOR_TIDLE_Pos)

#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_NONE                      (0x0U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT0                      (0x1U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT1                      (0x2U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT2                      (0x3U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT3                      (0x4U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT4                      (0x5U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT5                      (0x6U << I2CSMB_SADR_MASK_Pos)
#define    FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT6                      (0x7U << I2CSMB_SADR_MASK_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup I2C_SMBUS_FL_Exported_Functions I2C_SMBUS Exported Functions
  * @{
  */

/**
  * @brief    I2C_SMB enable
  * @rmtoll   CR1    EN    FL_I2CSMB_Enable
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_Enable(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_EN_Msk);
}

/**
  * @brief    Get I2C_SMB enable status
  * @rmtoll   CR1    EN    FL_I2CSMB_IsEnabled
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabled(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_EN_Msk) == I2CSMB_CR1_EN_Msk);
}

/**
  * @brief    I2C_SMB disable
  * @rmtoll   CR1    EN    FL_I2CSMB_Disable
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_Disable(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_EN_Msk);
}

/**
  * @brief    SCL time out enable
  * @rmtoll   CR1    A10EN    FL_I2CSMB_Enable10BitAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_Enable10BitAddress(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_A10EN_Msk);
}

/**
  * @brief    Get SCL time out enable status
  * @rmtoll   CR1    A10EN    FL_I2CSMB_IsEnabled10BitAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabled10BitAddress(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_A10EN_Msk) == I2CSMB_CR1_A10EN_Msk);
}

/**
  * @brief    SCL time out disable
  * @rmtoll   CR1    A10EN    FL_I2CSMB_Disable10BitAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_Disable10BitAddress(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_A10EN_Msk);
}

/**
  * @brief    CRC enable
  * @rmtoll   CR1    CRCEN    FL_I2CSMB_EnableCRC
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableCRC(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_CRCEN_Msk);
}

/**
  * @brief    Get CRC enable status
  * @rmtoll   CR1    CRCEN    FL_I2CSMB_IsEnabledCRC
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledCRC(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_CRCEN_Msk) == I2CSMB_CR1_CRCEN_Msk);
}

/**
  * @brief    CRC disable
  * @rmtoll   CR1    CRCEN    FL_I2CSMB_DisableCRC
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableCRC(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_CRCEN_Msk);
}

/**
  * @brief    Set digitalfilter length
  * @rmtoll   CR1    DNF    FL_I2CSMB_SetDigitalFilterLength
  * @param    I2CSMBx I2CSMB instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_DISABLE
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_1
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_2
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_3
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_4
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_5
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_6
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_7
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_8
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_9
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_10
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_11
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_12
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_13
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_14
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_15
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetDigitalFilterLength(I2CSMB_Type *I2CSMBx, uint32_t length)
{
    MODIFY_REG(I2CSMBx->CR1, I2CSMB_CR1_DNF_Msk, length);
}

/**
  * @brief    Get digital filter length
  * @rmtoll   CR1    DNF    FL_I2CSMB_GetDigitalFilterLength
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_DISABLE
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_1
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_2
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_3
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_4
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_5
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_6
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_7
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_8
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_9
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_10
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_11
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_12
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_13
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_14
  *           @arg @ref FL_I2CSMB_DIGITAL_FILTER_CLK_15
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetDigitalFilterLength(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_DNF_Msk));
}

/**
  * @brief    Analog Noise Filter enable
  * @rmtoll   CR1    ANFEN    FL_I2CSMB_EnableAnalogNoiseFilter
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableAnalogNoiseFilter(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_ANFEN_Msk);
}

/**
  * @brief    Get Analog Noise Filter enable status
  * @rmtoll   CR1    ANFEN    FL_I2CSMB_IsEnabledAnalogNoiseFilter
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledAnalogNoiseFilter(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_ANFEN_Msk) == I2CSMB_CR1_ANFEN_Msk);
}

/**
  * @brief    Analog Noise Filter disable
  * @rmtoll   CR1    ANFEN    FL_I2CSMB_DisableAnalogNoiseFilter
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableAnalogNoiseFilter(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_ANFEN_Msk);
}

/**
  * @brief    Transmit DMA enable
  * @rmtoll   CR1    TXDMAEN    FL_I2CSMB_EnableTXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableTXDMA(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_TXDMAEN_Msk);
}

/**
  * @brief    GetTransmit DMA enable status
  * @rmtoll   CR1    TXDMAEN    FL_I2CSMB_IsEnabledTXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledTXDMA(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_TXDMAEN_Msk) == I2CSMB_CR1_TXDMAEN_Msk);
}

/**
  * @brief    Transmit DMA disable
  * @rmtoll   CR1    TXDMAEN    FL_I2CSMB_DisableTXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableTXDMA(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_TXDMAEN_Msk);
}

/**
  * @brief    Receive DMA enable
  * @rmtoll   CR1    RXDMAEN    FL_I2CSMB_EnableRXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableRXDMA(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_RXDMAEN_Msk);
}

/**
  * @brief    GetReceive DMA enable status
  * @rmtoll   CR1    RXDMAEN    FL_I2CSMB_IsEnabledRXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledRXDMA(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_RXDMAEN_Msk) == I2CSMB_CR1_RXDMAEN_Msk);
}

/**
  * @brief    Receive DMA disable
  * @rmtoll   CR1    RXDMAEN    FL_I2CSMB_DisableRXDMA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableRXDMA(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_RXDMAEN_Msk);
}

/**
  * @brief    SlaveSCLStretching enable
  * @rmtoll   CR1    SCLSEN    FL_I2CSMB_EnableSlaveSCLStretching
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableSlaveSCLStretching(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_SCLSEN_Msk);
}

/**
  * @brief    Get SlaveSCLStretching enable status
  * @rmtoll   CR1    SCLSEN    FL_I2CSMB_IsEnabledSlaveSCLStretching
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledSlaveSCLStretching(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_SCLSEN_Msk) == I2CSMB_CR1_SCLSEN_Msk);
}

/**
  * @brief    SlaveSCLStretching disable
  * @rmtoll   CR1    SCLSEN    FL_I2CSMB_DisableSlaveSCLStretching
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableSlaveSCLStretching(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_SCLSEN_Msk);
}

/**
  * @brief    SMBus wakeup enable
  * @rmtoll   CR1    WKUPEN    FL_I2CSMB_SetWakeupSource
  * @param    I2CSMBx I2CSMB instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_WAKEUP_DISABLE
  *           @arg @ref FL_I2CSMB_WAKEUP_START_ONLY
  *           @arg @ref FL_I2CSMB_WAKEUP_START_BOTH
  *           @arg @ref FL_I2CSMB_WAKEUP_START_ADDRESS
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetWakeupSource(I2CSMB_Type *I2CSMBx, uint32_t source)
{
    MODIFY_REG(I2CSMBx->CR1, I2CSMB_CR1_WKUPEN_Msk, source);
}

/**
  * @brief    Get SMBus wakeup enable status
  * @rmtoll   CR1    WKUPEN    FL_I2CSMB_GetWakeupSource
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_WAKEUP_DISABLE
  *           @arg @ref FL_I2CSMB_WAKEUP_START_ONLY
  *           @arg @ref FL_I2CSMB_WAKEUP_START_BOTH
  *           @arg @ref FL_I2CSMB_WAKEUP_START_ADDRESS
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetWakeupSource(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_WKUPEN_Msk));
}

/**
  * @brief    General Call enable
  * @rmtoll   CR1    GCEN    FL_I2CSMB_EnableGeneralCall
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableGeneralCall(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_GCEN_Msk);
}

/**
  * @brief    Get General Call enable status
  * @rmtoll   CR1    GCEN    FL_I2CSMB_IsEnabledGeneralCall
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledGeneralCall(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_GCEN_Msk) == I2CSMB_CR1_GCEN_Msk);
}

/**
  * @brief    General Call disable
  * @rmtoll   CR1    GCEN    FL_I2CSMB_DisableGeneralCall
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableGeneralCall(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_GCEN_Msk);
}

/**
  * @brief    SMBus host address enable
  * @rmtoll   CR1    SMBHEN    FL_I2CSMB_EnableHostAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableHostAddress(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBHEN_Msk);
}

/**
  * @brief    Get SMBus host address enable status
  * @rmtoll   CR1    SMBHEN    FL_I2CSMB_IsEnabledHostAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledHostAddress(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBHEN_Msk) == I2CSMB_CR1_SMBHEN_Msk);
}

/**
  * @brief    SMBus host address disable
  * @rmtoll   CR1    SMBHEN    FL_I2CSMB_DisableHostAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableHostAddress(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBHEN_Msk);
}

/**
  * @brief    SMBus device default address enable
  * @rmtoll   CR1    SMBDEN    FL_I2CSMB_EnableDeviceDefaultAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableDeviceDefaultAddress(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBDEN_Msk);
}

/**
  * @brief    Get SMBus device default address enable status
  * @rmtoll   CR1    SMBDEN    FL_I2CSMB_IsEnabledDeviceDefaultAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledDeviceDefaultAddress(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBDEN_Msk) == I2CSMB_CR1_SMBDEN_Msk);
}

/**
  * @brief    SMBus device default address disable
  * @rmtoll   CR1    SMBDEN    FL_I2CSMB_DisableDeviceDefaultAddress
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableDeviceDefaultAddress(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_SMBDEN_Msk);
}

/**
  * @brief    SMBus Alert pin enable
  * @rmtoll   CR1    ALERTEN    FL_I2CSMB_EnableAlert
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableAlert(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_ALERTEN_Msk);
}

/**
  * @brief    Get SMBus Alert pin enable status
  * @rmtoll   CR1    ALERTEN    FL_I2CSMB_IsEnabledAlert
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledAlert(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_ALERTEN_Msk) == I2CSMB_CR1_ALERTEN_Msk);
}

/**
  * @brief    SMBus Alert pin disable
  * @rmtoll   CR1    ALERTEN    FL_I2CSMB_DisableMasterAlert
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableMasterAlert(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_ALERTEN_Msk);
}

/**
  * @brief    Master DMA automatic transfer end enable
  * @rmtoll   CR1    AUTOEND    FL_I2CSMB_EnableMasterAutoStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableMasterAutoStop(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR1, I2CSMB_CR1_AUTOEND_Msk);
}

/**
  * @brief    Get master DMA automatic transfer end enable status
  * @rmtoll   CR1    AUTOEND    FL_I2CSMB_IsEnabledMasterAutoStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledMasterAutoStop(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR1, I2CSMB_CR1_AUTOEND_Msk) == I2CSMB_CR1_AUTOEND_Msk);
}

/**
  * @brief    Master DMA automatic transfer end disable
  * @rmtoll   CR1    AUTOEND    FL_I2CSMB_DisableMasterAutoStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableMasterAutoStop(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR1, I2CSMB_CR1_AUTOEND_Msk);
}

/**
  * @brief    Set Alert pin status
  * @rmtoll   CR2    ALERT    FL_I2CSMB_SetAlertPinStatus
  * @param    I2CSMBx I2CSMB instance
  * @param    status This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_ALERT_STATUS_HIGH
  *           @arg @ref FL_I2CSMB_ALERT_STATUS_LOW
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetAlertPinStatus(I2CSMB_Type *I2CSMBx, uint32_t status)
{
    MODIFY_REG(I2CSMBx->CR2, I2CSMB_CR2_ALERT_Msk, status);
}

/**
  * @brief    Get Alert pin status
  * @rmtoll   CR2    ALERT    FL_I2CSMB_GetAlertPinStatus
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_ALERT_STATUS_HIGH
  *           @arg @ref FL_I2CSMB_ALERT_STATUS_LOW
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetAlertPinStatus(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_ALERT_Msk));
}

/**
  * @brief    Set ACK  output
  * @rmtoll   CR2    ACKEN    FL_I2CSMB_SetRespond
  * @param    I2CSMBx I2CSMB instance
  * @param    respond This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_RESPOND_ACK
  *           @arg @ref FL_I2CSMB_RESPOND_NACK
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetRespond(I2CSMB_Type *I2CSMBx, uint32_t respond)
{
    MODIFY_REG(I2CSMBx->CR2, I2CSMB_CR2_ACKEN_Msk, respond);
}

/**
  * @brief    Get ACK  output
  * @rmtoll   CR2    ACKEN    FL_I2CSMB_GetRespond
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_RESPOND_ACK
  *           @arg @ref FL_I2CSMB_RESPOND_NACK
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetRespond(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_ACKEN_Msk));
}

/**
  * @brief    Set master transmit direction
  * @rmtoll   CR2    RWN    FL_I2CSMB_SetMasterDirection
  * @param    I2CSMBx I2CSMB instance
  * @param    direction This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_MASTER_WRITE
  *           @arg @ref FL_I2CSMB_MASTER_READ
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetMasterDirection(I2CSMB_Type *I2CSMBx, uint32_t direction)
{
    MODIFY_REG(I2CSMBx->CR2, I2CSMB_CR2_RWN_Msk, direction);
}

/**
  * @brief    Get master transmit direction
  * @rmtoll   CR2    RWN    FL_I2CSMB_GetMasterDirection
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_MASTER_WRITE
  *           @arg @ref FL_I2CSMB_MASTER_READ
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetMasterDirection(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_RWN_Msk));
}

/**
  * @brief    Stop enable
  * @rmtoll   CR2    STOP    FL_I2CSMB_EnableStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableStop(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR2, I2CSMB_CR2_STOP_Msk);
}

/**
  * @brief    Get Stop enable status
  * @rmtoll   CR2    STOP    FL_I2CSMB_IsEnabledStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledStop(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_STOP_Msk) == I2CSMB_CR2_STOP_Msk);
}

/**
  * @brief    Stop disable
  * @rmtoll   CR2    STOP    FL_I2CSMB_DisableStop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableStop(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR2, I2CSMB_CR2_STOP_Msk);
}

/**
  * @brief    Reatart enable
  * @rmtoll   CR2    RESTART    FL_I2CSMB_EnableRestart
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableRestart(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR2, I2CSMB_CR2_RESTART_Msk);
}

/**
  * @brief    Get Reatart enable status
  * @rmtoll   CR2    RESTART    FL_I2CSMB_IsEnabledRestart
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledRestart(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_RESTART_Msk) == I2CSMB_CR2_RESTART_Msk);
}

/**
  * @brief    Reatart disable
  * @rmtoll   CR2    RESTART    FL_I2CSMB_DisableRestart
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableRestart(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR2, I2CSMB_CR2_RESTART_Msk);
}

/**
  * @brief    Start enable
  * @rmtoll   CR2    START    FL_I2CSMB_EnableStart
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableStart(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->CR2, I2CSMB_CR2_START_Msk);
}

/**
  * @brief    Get Start enable status
  * @rmtoll   CR2    START    FL_I2CSMB_IsEnabledStart
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledStart(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CR2, I2CSMB_CR2_START_Msk) == I2CSMB_CR2_START_Msk);
}

/**
  * @brief    Start disable
  * @rmtoll   CR2    START    FL_I2CSMB_DisableStart
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableStart(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->CR2, I2CSMB_CR2_START_Msk);
}

/**
  * @brief    IDLE disable
  * @rmtoll   IER    IDLIE    FL_I2CSMB_DisableIT_IDLE
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_IDLE(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_IDLIE_Msk);
}

/**
  * @brief    IDLE enable
  * @rmtoll   IER    IDLIE    FL_I2CSMB_EnableIT_IDLE
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_IDLE(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_IDLIE_Msk);
}

/**
  * @brief    Get IDLE enable status
  * @rmtoll   IER    IDLIE    FL_I2CSMB_IsEnabledIT_IDLE
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_IDLE(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_IDLIE_Msk) == I2CSMB_IER_IDLIE_Msk);
}

/**
  * @brief    ErrorEvent interrupt disable
  * @rmtoll   IER    ERRIE    FL_I2CSMB_DisableIT_ErrorEvent
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_ErrorEvent(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_ERRIE_Msk);
}

/**
  * @brief    ErrorEvent interrupt enable
  * @rmtoll   IER    ERRIE    FL_I2CSMB_EnableIT_ErrorEvent
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_ErrorEvent(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_ERRIE_Msk);
}

