waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_i2c_smbus.h
/**
  * @brief    Get ErrorEvent interrupt enable status
  * @rmtoll   IER    ERRIE    FL_I2CSMB_IsEnabledIT_ErrorEvent
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_ErrorEvent(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_ERRIE_Msk) == I2CSMB_IER_ERRIE_Msk);
}

/**
  * @brief    START interrupt disable
  * @rmtoll   IER    SIE    FL_I2CSMB_DisableIT_Start
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_Start(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_SIE_Msk);
}

/**
  * @brief    START interrupt enable
  * @rmtoll   IER    SIE    FL_I2CSMB_EnableIT_Start
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_Start(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_SIE_Msk);
}

/**
  * @brief    Get START interrupt enable status
  * @rmtoll   IER    SIE    FL_I2CSMB_IsEnabledIT_Start
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_Start(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_SIE_Msk) == I2CSMB_IER_SIE_Msk);
}

/**
  * @brief    Stop interrupt enable
  * @rmtoll   IER    PIE    FL_I2CSMB_EnableIT_Stop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_Stop(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_PIE_Msk);
}

/**
  * @brief    Get Stop interrupt enable status
  * @rmtoll   IER    PIE    FL_I2CSMB_IsEnabledIT_Stop
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_Stop(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_PIE_Msk) == I2CSMB_IER_PIE_Msk);
}

/**
  * @brief    Stop interrupt disable
  * @rmtoll   IER    PIE    FL_I2CSMB_DisableIT_Stop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_Stop(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_PIE_Msk);
}

/**
  * @brief    Non-ACK interrupt enable
  * @rmtoll   IER    NACKIE    FL_I2CSMB_EnableIT_NACK
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_NACK(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_NACKIE_Msk);
}

/**
  * @brief    Get Non-ACK interrupt enable status
  * @rmtoll   IER    NACKIE    FL_I2CSMB_IsEnabledIT_NACK
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_NACK(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_NACKIE_Msk) == I2CSMB_IER_NACKIE_Msk);
}

/**
  * @brief    Non-ACK interrupt disable
  * @rmtoll   IER    NACKIE    FL_I2CSMB_DisableIT_NACK
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_NACK(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_NACKIE_Msk);
}

/**
  * @brief    Address match interrupt enable
  * @rmtoll   IER    ADIE    FL_I2CSMB_EnableIT_SlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_SlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_ADIE_Msk);
}

/**
  * @brief    Get slave address match interrupt enable status
  * @rmtoll   IER    ADIE    FL_I2CSMB_IsEnabledIT_SlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_SlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_ADIE_Msk) == I2CSMB_IER_ADIE_Msk);
}

/**
  * @brief    Slave address match interrupt disable
  * @rmtoll   IER    ADIE    FL_I2CSMB_DisableIT_SlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_SlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_ADIE_Msk);
}

/**
  * @brief    Trasnmit done interrupt enable
  * @rmtoll   IER    TXIE    FL_I2CSMB_EnableIT_TXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_TXComplete(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_TXIE_Msk);
}

/**
  * @brief    Get trasnmit done interrupt enable
  * @rmtoll   IER    TXIE    FL_I2CSMB_IsEnabledIT_TXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_TXComplete(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_TXIE_Msk) == I2CSMB_IER_TXIE_Msk);
}

/**
  * @brief    Trasnmit done interrupt disable
  * @rmtoll   IER    TXIE    FL_I2CSMB_DisableIT_TXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_TXComplete(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_TXIE_Msk);
}

/**
  * @brief    Receive done interrupt enable
  * @rmtoll   IER    RXIE    FL_I2CSMB_EnableIT_RXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableIT_RXComplete(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->IER, I2CSMB_IER_RXIE_Msk);
}

/**
  * @brief    Get receive done interrupt enable status
  * @rmtoll   IER    RXIE    FL_I2CSMB_IsEnabledIT_RXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledIT_RXComplete(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->IER, I2CSMB_IER_RXIE_Msk) == I2CSMB_IER_RXIE_Msk);
}

/**
  * @brief    Receive done interrupt disable
  * @rmtoll   IER    RXIE    FL_I2CSMB_DisableIT_RXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableIT_RXComplete(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->IER, I2CSMB_IER_RXIE_Msk);
}

/**
  * @brief    Get Slave Direction
  * @rmtoll   ISR    SDIR    FL_I2CSMB_IsActiveFlag_SlaveDirection
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_SlaveDirection(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_SDIR_Msk) == (I2CSMB_ISR_SDIR_Msk));
}

/**
  * @brief    Get Alert flag
  * @rmtoll   ISR    ALIF    FL_I2CSMB_IsActiveFlag_Alert
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_Alert(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_ALIF_Msk) == (I2CSMB_ISR_ALIF_Msk));
}

/**
  * @brief    Clear Alert flag
  * @rmtoll   ISR    ALIF    FL_I2CSMB_ClearFlag_Alert
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_Alert(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_ALIF_Msk);
}

/**
  * @brief    Get Timeout B Flag
  * @rmtoll   ISR    TOB    FL_I2CSMB_IsActiveFlag_TimeoutB
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_TimeoutB(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_TOB_Msk) == (I2CSMB_ISR_TOB_Msk));
}

/**
  * @brief    Clear Timeout B flag
  * @rmtoll   ISR    TOB    FL_I2CSMB_ClearFlag_TimeoutB
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_TimeoutB(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_TOB_Msk);
}

/**
  * @brief    Get Timeout A Flag
  * @rmtoll   ISR    TOA    FL_I2CSMB_IsActiveFlag_TimeoutA
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_TimeoutA(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_TOA_Msk) == (I2CSMB_ISR_TOA_Msk));
}

/**
  * @brief    Clear Timeout A flag
  * @rmtoll   ISR    TOA    FL_I2CSMB_ClearFlag_TimeoutA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_TimeoutA(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_TOA_Msk);
}

/**
  * @brief    Get overflow interrupt flag
  * @rmtoll   ISR    OVF    FL_I2CSMB_IsActiveFlag_Overflow
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_Overflow(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_OVF_Msk) == (I2CSMB_ISR_OVF_Msk));
}

/**
  * @brief    Clear overflow interrupt flag
  * @rmtoll   ISR    OVF    FL_I2CSMB_ClearFlag_Overflow
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_Overflow(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_OVF_Msk);
}

/**
  * @brief    Get bus error interrupt flag
  * @rmtoll   ISR    BERR    FL_I2CSMB_IsActiveFlag_BusError
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_BusError(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_BERR_Msk) == (I2CSMB_ISR_BERR_Msk));
}

/**
  * @brief    Clear bus error interrupt flag
  * @rmtoll   ISR    BERR    FL_I2CSMB_ClearFlag_BusError
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_BusError(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_BERR_Msk);
}

/**
  * @brief    Get bus IDLE interrupt flag
  * @rmtoll   ISR    IDLIF    FL_I2CSMB_IsActiveFlag_BusIDLE
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_BusIDLE(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_IDLIF_Msk) == (I2CSMB_ISR_IDLIF_Msk));
}

/**
  * @brief    Clear bus IDLE interrupt flag
  * @rmtoll   ISR    IDLIF    FL_I2CSMB_ClearFlag_BusIDLE
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_BusIDLE(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_IDLIF_Msk);
}

/**
  * @brief    Get Start interrupt flag
  * @rmtoll   ISR    SIF    FL_I2CSMB_IsActiveFlag_Start
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_Start(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_SIF_Msk) == (I2CSMB_ISR_SIF_Msk));
}

/**
  * @brief    Clear Start interrupt flag
  * @rmtoll   ISR    SIF    FL_I2CSMB_ClearFlag_Start
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_Start(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_SIF_Msk);
}

/**
  * @brief    Get Stop interrupt flag
  * @rmtoll   ISR    PIF    FL_I2CSMB_IsActiveFlag_Stop
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_Stop(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_PIF_Msk) == (I2CSMB_ISR_PIF_Msk));
}

/**
  * @brief    Clear Stor interrupt flag
  * @rmtoll   ISR    PIF    FL_I2CSMB_ClearFlag_Stop
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_Stop(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_PIF_Msk);
}

/**
  * @brief    Get acknowledge status flag
  * @rmtoll   ISR    NACKIF    FL_I2CSMB_IsActiveFlag_NACK
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_NACK(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_NACKIF_Msk) == (I2CSMB_ISR_NACKIF_Msk));
}

/**
  * @brief    Clear acknowledge status flag
  * @rmtoll   ISR    NACKIF    FL_I2CSMB_ClearFlag_NACK
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_NACK(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_NACKIF_Msk);
}

/**
  * @brief    Get address match interrupt flag
  * @rmtoll   ISR    ADIF    FL_I2CSMB_IsActiveFlag_AddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_AddressMatch(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_ADIF_Msk) == (I2CSMB_ISR_ADIF_Msk));
}

/**
  * @brief    Clear address match interrupt flag
  * @rmtoll   ISR    ADIF    FL_I2CSMB_ClearFlag_AddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_AddressMatch(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_ADIF_Msk);
}

/**
  * @brief    Get trasnmit done interrupt flag
  * @rmtoll   ISR    TXIF    FL_I2CSMB_IsActiveFlag_TXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_TXComplete(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_TXIF_Msk) == (I2CSMB_ISR_TXIF_Msk));
}

/**
  * @brief    Clear trasnmit done interrupt flag
  * @rmtoll   ISR    TXIF    FL_I2CSMB_ClearFlag_TXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_TXComplete(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_TXIF_Msk);
}

/**
  * @brief    Get receive done interrupt flag
  * @rmtoll   ISR    RXIF    FL_I2CSMB_IsActiveFlag_RXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsActiveFlag_RXComplete(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->ISR, I2CSMB_ISR_RXIF_Msk) == (I2CSMB_ISR_RXIF_Msk));
}

/**
  * @brief    Clear receive done interrupt flag
  * @rmtoll   ISR    RXIF    FL_I2CSMB_ClearFlag_RXComplete
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_ClearFlag_RXComplete(I2CSMB_Type *I2CSMBx)
{
    WRITE_REG(I2CSMBx->ISR, I2CSMB_ISR_RXIF_Msk);
}

/**
  * @brief    Set master SCL high level length
  * @rmtoll   BGR    BGRH    FL_I2CSMB_WriteSCLHighWidth
  * @param    I2CSMBx I2CSMB instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteSCLHighWidth(I2CSMB_Type *I2CSMBx, uint32_t width)
{
    MODIFY_REG(I2CSMBx->BGR, (0x1ffU << 16U), (width << 16U));
}

/**
  * @brief    Get master SCL high level length
  * @rmtoll   BGR    BGRH    FL_I2CSMB_ReadSCLHighWidth
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadSCLHighWidth(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->BGR, (0x1ffU << 16U)) >> 16U);
}

/**
  * @brief    Set master SCL low level length
  * @rmtoll   BGR    BGRL    FL_I2CSMB_WriteSCLLowWidth
  * @param    I2CSMBx I2CSMB instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteSCLLowWidth(I2CSMB_Type *I2CSMBx, uint32_t width)
{
    MODIFY_REG(I2CSMBx->BGR, (0x1ffU << 0U), (width << 0U));
}

/**
  * @brief    Get master SCL low level length
  * @rmtoll   BGR    BGRL    FL_I2CSMB_ReadSCLLowWidth
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadSCLLowWidth(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->BGR, (0x1ffU << 0U)) >> 0U);
}

/**
  * @brief    Set SDA hold time
  * @rmtoll   TCR    SDAHD    FL_I2CSMB_WriteSDAHoldTime
  * @param    I2CSMBx I2CSMB instance
  * @param    time
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteSDAHoldTime(I2CSMB_Type *I2CSMBx, uint32_t time)
{
    MODIFY_REG(I2CSMBx->TCR, (0x1ffU << 0U), (time << 0U));
}

/**
  * @brief    Get SDA hold time
  * @rmtoll   TCR    SDAHD    FL_I2CSMB_ReadSDAHoldTime
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadSDAHoldTime(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TCR, (0x1ffU << 0U)) >> 0U);
}

/**
  * @brief    Timeout enable
  * @rmtoll   TOR    TEXTEN    FL_I2CSMB_EnableTimeOutB
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableTimeOutB(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->TOR, I2CSMB_TOR_TEXTEN_Msk);
}

/**
  * @brief    Get timeout enable status
  * @rmtoll   TOR    TEXTEN    FL_I2CSMB_IsEnabledTimeOutB
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledTimeOutB(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TOR, I2CSMB_TOR_TEXTEN_Msk) == I2CSMB_TOR_TEXTEN_Msk);
}

/**
  * @brief    Timeout disable
  * @rmtoll   TOR    TEXTEN    FL_I2CSMB_DisableTimeOutB
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableTimeOutB(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->TOR, I2CSMB_TOR_TEXTEN_Msk);
}

/**
  * @brief    Set timeout numbers
  * @rmtoll   TOR    TIMEOUTB    FL_I2CSMB_WriteTimeOutBTime
  * @param    I2CSMBx I2CSMB instance
  * @param    time
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteTimeOutBTime(I2CSMB_Type *I2CSMBx, uint32_t time)
{
    MODIFY_REG(I2CSMBx->TOR, (0xfffU << 16U), (time << 16U));
}

/**
  * @brief    Get timeout numbers
  * @rmtoll   TOR    TIMEOUTB    FL_I2CSMB_ReadTimeOutBTime
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadTimeOutBTime(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TOR, (0xfffU << 16U)) >> 16U);
}

/**
  * @brief    Timeout enable
  * @rmtoll   TOR    TOEN    FL_I2CSMB_EnableTimeOutA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableTimeOutA(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->TOR, I2CSMB_TOR_TOEN_Msk);
}

/**
  * @brief    Get timeout enable status
  * @rmtoll   TOR    TOEN    FL_I2CSMB_IsEnabledTimeOutA
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledTimeOutA(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TOR, I2CSMB_TOR_TOEN_Msk) == I2CSMB_TOR_TOEN_Msk);
}

/**
  * @brief    Timeout disable
  * @rmtoll   TOR    TOEN    FL_I2CSMB_DisableTimeOutA
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableTimeOutA(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->TOR, I2CSMB_TOR_TOEN_Msk);
}

/**
  * @brief    Set timeoutA mode
  * @rmtoll   TOR    TIDLE    FL_I2CSMB_SetTimeOutAMode
  * @param    I2CSMBx I2CSMB instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_TIMEOUTA_MODE_SCL
  *           @arg @ref FL_I2CSMB_TIMEOUTA_MODE_IDLE
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetTimeOutAMode(I2CSMB_Type *I2CSMBx, uint32_t mode)
{
    MODIFY_REG(I2CSMBx->TOR, I2CSMB_TOR_TIDLE_Msk, mode);
}

/**
  * @brief    Get timeoutA mode
  * @rmtoll   TOR    TIDLE    FL_I2CSMB_GetTimeOutAMode
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_TIMEOUTA_MODE_SCL
  *           @arg @ref FL_I2CSMB_TIMEOUTA_MODE_IDLE
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetTimeOutAMode(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TOR, I2CSMB_TOR_TIDLE_Msk));
}

/**
  * @brief    Set timeout numbers
  * @rmtoll   TOR    TIMEOUTA    FL_I2CSMB_WriteTimeOutATime
  * @param    I2CSMBx I2CSMB instance
  * @param    time
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteTimeOutATime(I2CSMB_Type *I2CSMBx, uint32_t time)
{
    MODIFY_REG(I2CSMBx->TOR, (0xfffU << 0U), (time << 0U));
}

/**
  * @brief    Get timeout numbers
  * @rmtoll   TOR    TIMEOUTA    FL_I2CSMB_ReadTimeOutATime
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadTimeOutATime(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TOR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get Rxbuff
  * @rmtoll   RXBUF    RXDATA    FL_I2CSMB_ReadRXBuff
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadRXBuff(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->RXBUF, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set TX Buff
  * @rmtoll   TXBUF    TXDATA    FL_I2CSMB_WriteTXBuff
  * @param    I2CSMBx I2CSMB instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteTXBuff(I2CSMB_Type *I2CSMBx, uint32_t data)
{
    MODIFY_REG(I2CSMBx->TXBUF, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    Get TX Buff
  * @rmtoll   TXBUF    TXDATA    FL_I2CSMB_ReadTXBuff
  * @param    I2CSMBx I2CSMB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadTXBuff(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->TXBUF, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    slave address match enable
  * @rmtoll   SADR    SAEN    FL_I2CSMB_EnableSlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_EnableSlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    SET_BIT(I2CSMBx->SADR, I2CSMB_SADR_SAEN_Msk);
}

/**
  * @brief    Get slave address match enable status
  * @rmtoll   SADR    SAEN    FL_I2CSMB_IsEnabledSlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2CSMB_IsEnabledSlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->SADR, I2CSMB_SADR_SAEN_Msk) == I2CSMB_SADR_SAEN_Msk);
}

/**
  * @brief    Slave address match disable
  * @rmtoll   SADR    SAEN    FL_I2CSMB_DisableSlaveAddressMatch
  * @param    I2CSMBx I2CSMB instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_DisableSlaveAddressMatch(I2CSMB_Type *I2CSMBx)
{
    CLEAR_BIT(I2CSMBx->SADR, I2CSMB_SADR_SAEN_Msk);
}

/**
  * @brief    Set slave address mask
  * @rmtoll   SADR    MASK    FL_I2CSMB_SetSlaveAddressMask
  * @param    I2CSMBx I2CSMB instance
  * @param    address This parameter can be one of the following values:
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_NONE
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT0
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT1
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT2
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT3
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT4
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT5
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT6
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_SetSlaveAddressMask(I2CSMB_Type *I2CSMBx, uint32_t address)
{
    MODIFY_REG(I2CSMBx->SADR, I2CSMB_SADR_MASK_Msk, address);
}

/**
  * @brief    Get slave address mask
  * @rmtoll   SADR    MASK    FL_I2CSMB_GetSlaveAddressMask
  * @param    I2CSMBx I2CSMB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_NONE
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT0
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT1
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT2
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT3
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT4
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT5
  *           @arg @ref FL_I2CSMB_SLAVE_ADDRESS_MASK_BIT6
  */
__STATIC_INLINE uint32_t FL_I2CSMB_GetSlaveAddressMask(I2CSMB_Type *I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->SADR, I2CSMB_SADR_MASK_Msk));
}

